ИС_СПОРТ_2022/src/Catalogs/ОбразованиеТренеров/ОбразованиеТренеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбразованиеТренеров</name>
  <owners>Catalog.Тренеры</owners>
  <attributes>
    <name>ОсновноеОбразование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <type>
      <types>EnumRef.ВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебноеЗаведение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьОбучения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКурсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовОбОбразовании</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияКвалификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизкультурноеОбразование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Enums/ВидыОбучения/ВидыОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбучения</name>
  <enumValues>
    <name>Переподготовка</name>
  </enumValues>
  <enumValues>
    <name>ПовышениеКвалификации</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Catalogs/ОбразованиеТренеров/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ВидОбразования = "1";
		Объект.ОсновноеОбразование = Истина;
	Иначе
		ВидОбразования = ?(Объект.ОсновноеОбразование, "1", "2");
	КонецЕсли;
	
	// {Рарус adilas #9708 -Заполнять поле "Тренер" при создании квалификационной категории 2020.09.25
	//
	Если Параметры.Свойство("Тренер") Тогда
		Объект.Владелец = Параметры.Тренер;
	КонецЕсли;
	// }Рарус adilas #9708 -Заполнять поле "Тренер" при создании квалификационной категории 2020.09.25
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = СокрЛП(Объект.Владелец) + "/" + ?(Объект.ОсновноеОбразование, "Основное", "Дополнительное");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитов

&НаКлиенте
Процедура ВидОбразованияПереключательПриИзменении(Элемент)
	
	Объект.ОсновноеОбразование = ВидОбразования = "1";
	Если ВидОбразования = "1" Тогда
		Объект.ВидОбучения = "";
	Иначе
		Объект.ФизкультурноеОбразование = Ложь;
	КонецЕсли;	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбученияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	Если НЕ Объект.ВидОбучения = ПредопределенноеЗначение("Перечисление.ВидыОбучения.ПовышениеКвалификации") Тогда
		Объект.Квалификация = "";
		Объект.СрокДействияКвалификации = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаОсновноеОбразование.Видимость = Объект.ОсновноеОбразование;
	Элементы.ГруппаДополнительноеОбразование.Видимость = НЕ Объект.ОсновноеОбразование;
	Элементы.ГруппаКвалификация.Видимость = Объект.ВидОбучения = ПредопределенноеЗначение("Перечисление.ВидыОбучения.ПовышениеКвалификации");
	
КонецПроцедуры	

#КонецОбласти
